### Create a Pandas Series from the list [10, 20, 30, 40, 50]. Print the Series, its index, and data type. Then create a DataFrame with columns "Name", "Age", and "City" containing at least 4 rows of data.

In [1]:
import pandas as pd

In [4]:
lst = [10,20,30,40,50]
df = pd.DataFrame(lst)
print(df)
print(type(df))

    0
0  10
1  20
2  30
3  40
4  50
<class 'pandas.core.frame.DataFrame'>

### Using any DataFrame, write code to print the number of rows and columns, column data types (.dtypes), and summary statistics (.describe()).

In [9]:
df = pd.read_csv('large_sample_data.csv')
print(df.shape)
print(df.columns.dtype)
print(df.describe())

(100, 5)
object
              Age         Salary
count  100.000000     100.000000
mean    40.290000   75419.680000
std     11.465623   26232.554773
min     18.000000   31056.000000
25%     32.000000   52071.250000
50%     40.000000   75183.000000
75%     49.500000   99385.750000
max     59.000000  119682.000000

### Create a DataFrame using the dictionary below:


data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

Print .columns, .index. Access a single column and one full row.

In [16]:
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

df = pd.DataFrame(data)
print(df.columns)
print(df.index)
print(df['Product'])
print(df[1:2])

Index(['Product', 'Price', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=4, step=1)
0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object
  Product  Price  Quantity
1    Book     50        60

### 4. Using .loc[] and .iloc[], show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [ ]:
df = pd.read_csv('large_sample_data.csv')
# print(df.loc[:0,])
# print(df['Age'])

print(df.iloc[0:1,[1,2]])

print(df.iloc[4:6,[3,4]])

   Age    City
0   40  Sydney
   Salary Department
4   51002         HR
5  115162         HR

      Name  Age    City  Salary Department
0    Grace   40  Sydney   45840         HR
1    Grace   48    Rome   96899    Finance
2      Eve   30  Sydney  119682         HR
3      Bob   53   Paris   31508  Marketing
4    Julia   49   Paris   51002         HR
..     ...  ...     ...     ...        ...
95   Grace   22    Rome   51570         HR
96     Eve   45  Sydney   75542         IT
97     Bob   53   Dubai  105736  Marketing
98   Grace   48  Berlin   99475         HR
99  Hannah   51   Paris  117174      Sales

[100 rows x 5 columns]

In [41]:
df.drop(columns='Age')

      Name    City  Salary Department
0    Grace  Sydney   45840         HR
1    Grace    Rome   96899    Finance
2      Eve  Sydney  119682         HR
3      Bob   Paris   31508  Marketing
4    Julia   Paris   51002         HR
..     ...     ...     ...        ...
95   Grace    Rome   51570         HR
96     Eve  Sydney   75542         IT
97     Bob   Dubai  105736  Marketing
98   Grace  Berlin   99475         HR
99  Hannah   Paris  117174      Sales

[100 rows x 4 columns]

In [51]:
sort_columns = df.sort_values('Age',ascending=False)
print(sort_columns)

       Name  Age      City  Salary Department
25      Ian   59      Rome   83075         IT
48      Ian   59    Madrid   65942  Marketing
66      Bob   59    Sydney  109339         IT
49    Julia   58    Berlin   57262    Finance
39    Grace   58    London   87010         IT
..      ...  ...       ...     ...        ...
29    Frank   20   Toronto   95194         IT
34      Eve   20     Dubai   73327  Marketing
82  Charlie   19   Toronto  107425         HR
30      Eve   18     Dubai  101296  Marketing
45  Charlie   18  New York   55055         HR

[100 rows x 5 columns]

In [58]:
df[(df['Age']>=30) & (df['Salary']>=50000)]

       Name  Age     City  Salary Department
1     Grace   48     Rome   96899    Finance
2       Eve   30   Sydney  119682         HR
4     Julia   49    Paris   51002         HR
5       Eve   51  Toronto  115162         HR
8   Charlie   57    Tokyo   81101  Marketing
..      ...  ...      ...     ...        ...
94    Alice   49     Rome   60142         IT
96      Eve   45   Sydney   75542         IT
97      Bob   53    Dubai  105736  Marketing
98    Grace   48   Berlin   99475         HR
99   Hannah   51    Paris  117174      Sales

[61 rows x 5 columns]